namespace ResaleTelegramBot.Telegram.Texts.Output;

public class ResponseMessageStaticTexts
{
    public static string OnStart = """
                                   Привет 👋
                                   Добро пожаловать в 511market.

                                   Покупаешь или продаёшь — всё делается здесь и сейчас.
                                   Выбирай действие:
                                   """;

    public static string OnNameEntering = """
                                          Отлично!

                                          Введите название своего товара
                                          """;

    public static string OnListingPriceEntering = """
                                                  Введите цену товара
                                                  """;

    public static string OnAddListingCompleted = """
                                                 Отлично! Вы ввели все данные.

                                                 Опубликовать обьявление?
                                                 """;

    public static string OnSuccessfulListingPublication = """
                                                          Ваше обьявление успешно опубликовано! Вы можете посмотреть его во вкладке Профиль
                                                          """;

    public static string OnFailedListingPublication = """
                                                      Произошла ошибка при публикации вашего обьявления. Попробуйте снова, и в случае неудачи обратитесь в тех поддержку
                                                      """;

    public static string OnAddListingDescription = """
                                                   Отлично!

                                                   Введите описание своего товара
                                                   """;

    public static string OnCategoryChoosingOnAddingListing = """
                                                             Хорошо. Теперь выберите категорию для вашего товара из нижеперечисленных
                                                             """;
}