namespace ResaleTelegramBot.Telegram.Texts.Output;

public class ResponseMessageStaticTexts
{
    public static string OnStart = """
                                   Привет 👋
                                   Добро пожаловать в 511market.

                                   Покупаешь или продаёшь — всё делается здесь и сейчас
                                   Выбирай действие:
                                   """;

    public static string OnCategoryChoosingOnAddingListing = """
                                                             Начнём ✨

                                                             Выберите категорию, к которой относится вещь. Это поможет пользователям быстрее найти ваше объявление 👇
                                                             """;

    public static string OnNameEntering = """
                                          Отлично ✅

                                          Теперь введите название вещи в ниже:
                                          """;

    public static string OnListingPriceEntering = """
                                                  Теперь укажите цену (в рублях, без названия валюты) 💰
                                                  """;

    public static string OnAddListingDescription = """
                                                   Хорошо 👍

                                                   Добавьте короткое описание: состояние, материал, особенности
                                                   """;

    public static string OnAddListingCompleted = """
                                                 Всё готово 🎉

                                                 Опубликовать объявление?
                                                 """;

    public static string OnSuccessfulListingPublication = """
                                                          Готово ✅

                                                          Ваше объявление опубликовано.
                                                          Его можно найти во вкладке «Профиль»
                                                          """;

    public static string OnFailedListingPublication = """
                                                      Ошибка при публикации ❗

                                                      Попробуйте ещё раз
                                                      Если проблема повторяется — обратитесь в поддержку
                                                      """;
}